INSERT INTO t_location (item_id, microdistrict_id, street) VALUES
                                                               (1, 9, 'ул. Фурманова 120'),
                                                               (2, 22, 'пр. Абая 90'),
                                                               (3, 52, 'ул. Гагарина 75'),
                                                               (4, 54, 'ул. Толе би 230'),
                                                               (5, 58, 'пр. Райымбека 15'),
                                                               (6, 15, 'ул. Алтынсарина 32'),
                                                               (7, 20, 'ул. Байтурсынова 120'),
                                                               (8, 23, 'ул. Ауэзова 50'),
                                                               (9, 30, 'ул. Шевченко 12'),
                                                               (10, 35, 'ул. Сатпаева 95');
