ALTER TABLE t_microdistrict
    ADD COLUMN parent_id INT REFERENCES t_microdistrict(id);


INSERT INTO t_microdistrict (id, name, name_kz, name_ru, parent_id) VALUES
                                                                        (1, 'Alatau', 'Алатау', 'Алатауский', NULL),
                                                                        (2, 'Almaly', 'Алмалы', 'Алмалинский', NULL),
                                                                        (3, 'Auezov', 'Әуезов', 'Ауэзовский', NULL),
                                                                        (4, 'Bostandyk', 'Бостандық', 'Бостандыкский', NULL),
                                                                        (5, 'Zhetysu', 'Жетісу', 'Жетысуский', NULL),
                                                                        (6, 'Medeu', 'Медеу', 'Медеуский', NULL),
                                                                        (7, 'Nauryzbay', 'Наурызбай', 'Наурызбайский', NULL),
                                                                        (8, 'Turksib', 'Түрксіб', 'Турксибский', NULL),

                                                                        (9, 'Akkent', 'Аккент', 'Аккент', 1),
                                                                        (10, 'Nurkent', 'Нұркент', 'Нуркент', 1),
                                                                        (11, 'Rahat', 'Рахат', 'Рахат', 1),
                                                                        (12, 'Algabas', 'Алғабас', 'Алгабас', 1),
                                                                        (13, 'Tomiris', 'Томирис', 'Томирис', 1),

                                                                        (14, 'Ainabulak-1', 'Айнабулак-1', 'Айнабулак-1', 5),
                                                                        (15, 'Ainabulak-2', 'Айнабулак-2', 'Айнабулак-2', 5),
                                                                        (16, 'Ainabulak-3', 'Айнабулак-3', 'Айнабулак-3', 5),
                                                                        (17, 'Tastak-1', 'Тастақ-1', 'Тастак-1', 3),
                                                                        (18, 'Tastak-2', 'Тастақ-2', 'Тастак-2', 2),
                                                                        (19, 'Tastak-3', 'Тастақ-3', 'Тастак-3', 2),

                                                                        (20, 'Aksay-1', 'Ақсай-1', 'Аксай-1', 3),
                                                                        (21, 'Aksay-2', 'Ақсай-2', 'Аксай-2', 3),
                                                                        (22, 'Aksay-3', 'Ақсай-3', 'Аксай-3', 3),
                                                                        (23, 'Aksay-4', 'Ақсай-4', 'Аксай-4', 3),

                                                                        (24, 'Mamyr-1', 'Мамыр-1', 'Мамыр-1', 3),
                                                                        (25, 'Mamyr-2', 'Мамыр-2', 'Мамыр-2', 3),
                                                                        (26, 'Mamyr-3', 'Мамыр-3', 'Мамыр-3', 3),
                                                                        (27, 'Mamyr-4', 'Мамыр-4', 'Мамыр-4', 3),
                                                                        (28, 'Mamyr-5', 'Мамыр-5', 'Мамыр-5', 3),

                                                                        (29, 'Kuldy', 'Күлді', 'Кулды', 3),
                                                                        (30, 'Shugyla', 'Шұғыла', 'Шугыла', 3),

                                                                        (31, 'Samal-1', 'Самал-1', 'Самал-1', 4),
                                                                        (32, 'Samal-2', 'Самал-2', 'Самал-2', 4),
                                                                        (33, 'Samal-3', 'Самал-3', 'Самал-3', 4),

                                                                        (34, 'Orbita-1', 'Орбита-1', 'Орбита-1', 4),
                                                                        (35, 'Orbita-2', 'Орбита-2', 'Орбита-2', 4),
                                                                        (36, 'Orbita-3', 'Орбита-3', 'Орбита-3', 4),
                                                                        (37, 'Orbita-4', 'Орбита-4', 'Орбита-4', 4),

                                                                        (38, 'Taugul-1', 'Таугүл-1', 'Таугуль-1', 4),
                                                                        (39, 'Taugul-2', 'Таугүл-2', 'Таугуль-2', 4),

                                                                        (40, 'Kazakhfilm', 'Қазақфильм', 'Казахфильм', 4),
                                                                        (41, 'Koktem-1', 'Көктем-1', 'Коктем-1', 4),
                                                                        (42, 'Koktem-2', 'Көктем-2', 'Коктем-2', 4),
                                                                        (43, 'Darkhan', 'Дархан', 'Дархан', 4),
                                                                        (44, 'Nurlytau', 'Нұрлытау', 'Нурлытау', 4),

                                                                        (45, 'Zhetysu-1', 'Жетісу-1', 'Жетысу-1', 5),
                                                                        (46, 'Zhetysu-2', 'Жетісу-2', 'Жетысу-2', 3),
                                                                        (47, 'Zhetysu-3', 'Жетісу-3', 'Жетысу-3', 5),
                                                                        (48, 'Zhetysu-4', 'Жетісу-4', 'Жетысу-4', 5),
                                                                        (49, 'Zhetysu-5', 'Жетісу-5', 'Жетысу-5', 5),
                                                                        (50, 'Zhetysu-6', 'Жетісу-6', 'Жетысу-6', 5),

                                                                        (51, 'Northern Ring', 'Солтүстік шеңбері', 'Северное кольцо', 5),
                                                                        (52, 'Koktobe', 'Көктөбе', 'Коктобе', 6),
                                                                        (53, 'Samal', 'Самал', 'Самал', 6),
                                                                        (54, 'Gorny Gigant', 'Тау алыбы', 'Горный гигант', 6),
                                                                        (55, 'Butakovka', 'Бұтақовка', 'Бутаковка', 6),
                                                                        (56, 'Duman', 'Думан', 'Думан', 6),

                                                                        (57, 'Kalkaman-1', 'Қалқаман-1', 'Қалқаман-1', 7),
                                                                        (58, 'Kalkaman-2', 'Қалқаман-2', 'Қалқаман-2', 7),
                                                                        (59, 'Tastybulak', 'Тастыбұлақ', 'Тастыбулак', 7),
                                                                        (60, 'Asyl Arman', 'Асыл Арман', 'Асыл Арман', 7),

                                                                        (61, 'Sayakhat', 'Саяхат', 'Саяхат', 8),
                                                                        (62, 'Suyunbaya', 'Сүйінбай', 'Суюнбая', 8),
                                                                        (63, 'Zhas Kanat', 'Жас Қанат', 'Жас Канат', 8),
                                                                        (64, 'Zhuldyz', 'Жұлдыз', 'Жулдыз', 8),
                                                                        (65, 'Ainabulak-4', 'Айнабулак-4', 'Айнабулак-4', 8);