INSERT INTO t_translate(name, name_kz, name_ru) VALUES
                                                    ('All', 'Жалпы', 'Все'),

-- First-level
                                                    ('Transport', 'Көлік', 'Транспорт'),
                                                    ('Electronics & Gadgets', 'Электроника және гаджеттер', 'Электроника и гаджеты'),
                                                    ('Tools & Equipment', 'Құралдар мен жабдықтар', 'Инструменты и оборудование'),
                                                    ('Clothing & Accessories', 'Киім және аксессуарлар', 'Одежда и аксессуары'),
                                                    ('Entertainment & Events', 'Ойын-сауық және іс-шаралар', 'Развлечения и мероприятия'),
                                                    ('Real Estate', 'Жылжымайтын мүлік', 'Недвижимость'),
                                                    ('Home & Furniture', 'Үй және жиһаз', 'Дом и мебель'),
                                                    ('Outdoor & Sports', 'Ашық ауада және спорт', 'На свежем воздухе и спорт'),

-- Transport
                                                    ('Cars', 'Көліктер', 'Автомобили'),
                                                    ('Bicycles & Scooters', 'Велосипедтер және самокаттар', 'Велосипеды и самокаты'),
                                                    ('Motorcycles', 'Мотоциклдер', 'Мотоциклы'),
                                                    ('Moving & Delivery Vehicles', 'Жүк және жеткізу көліктері', 'Грузовые и доставочные машины'),

-- Cars
                                                    ('Sedans', 'Седандар', 'Седаны'),
                                                    ('SUVs & Crossovers', 'Жол талғамайтын және кроссоверлер', 'Внедорожники и кроссоверы'),
                                                    ('Minivans', 'Минивэндер', 'Минивэны'),
                                                    ('Compact Cars', 'Шағын көліктер', 'Компактные автомобили'),

-- Bicycles & Scooters
                                                    ('Bicycles', 'Велосипедтер', 'Велосипеды'),
                                                    ('Electric Scooters', 'Электр самокаттар', 'Электросамокаты'),
                                                    ('Kick Scooters', 'Самокаттар', 'Самокаты'),

-- Moving & Delivery Vehicles
                                                    ('Cargo Vans', 'Жүк фургондары', 'Грузовые фургоны'),
                                                    ('Pickup Trucks', 'Пикаптар', 'Пикапы'),
                                                    ('Motorized Carts', 'Моторлы арбалар', 'Моторизованные тележки'),

-- Electronics & Gadgets
                                                    ('Computers & Accessories', 'Компьютерлер және керек-жарақтар', 'Компьютеры и аксессуары'),
                                                    ('Photo & Video Equipment', 'Фото және видео жабдықтар', 'Фото- и видеооборудование'),
                                                    ('Home Appliances', 'Үйге арналған тұрмыстық техника', 'Бытовая техника'),

-- Computers & Accessories
                                                    ('Laptops', 'Ноутбуктер', 'Ноутбуки'),
                                                    ('Tablets', 'Планшеттер', 'Планшеты'),
                                                    ('Gaming Consoles', 'Ойын консолдері', 'Игровые приставки'),
                                                    ('Projectors', 'Проекторлар', 'Проекторы'),

-- Photo & Video Equipment
                                                    ('Cameras', 'Камералар', 'Камеры'),
                                                    ('Lenses', 'Объективтер', 'Объективы'),
                                                    ('Drones', 'Дрондар', 'Дроны'),
                                                    ('Lighting Equipment', 'Жарық жабдықтары', 'Осветительное оборудование'),

-- Home Appliances
                                                    ('Vacuum Cleaners', 'Шаңсорғыштар', 'Пылесосы'),
                                                    ('Microwaves', 'Микротолқынды пештер', 'Микроволновки'),
                                                    ('Coffee Machines', 'Кофеқайнатқыштар', 'Кофемашины'),
                                                    ('Air Conditioners', 'Кондиционерлер', 'Кондиционеры'),

-- Tools & Equipment
                                                    ('Construction Tools', 'Құрылыс құралдары', 'Строительные инструменты'),
                                                    ('Garden Equipment', 'Бақша жабдықтары', 'Садовое оборудование'),

-- Construction Tools
                                                    ('Power Tools', 'Электр құралдары', 'Электроинструменты'),
                                                    ('Hand Tools', 'Қол құралдары', 'Ручной инструмент'),
                                                    ('Scaffolding & Ladders', 'Орман мен баспалдақтар', 'Строительные леса и лестницы'),

-- Garden Equipment
                                                    ('Lawn Mowers', 'Шөп шабатын машиналар', 'Газонокосилки'),
                                                    ('Trimmers', 'Триммерлер', 'Триммеры'),
                                                    ('Chainsaws', 'Бензопылдар', 'Бензопилы');
